tutorials/multiphase/interFoam/laminar/waves/waveMakerSolitary/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale           1;

vertices
(
    //mov
    ( 0 0 0)
    ( 4 0 0)
    ( 4 0.008 0)
    ( 0 0.008 0)
    ( 0 0 0.6)
    ( 4 0 0.6)
    ( 4 0.008 0.6)
    ( 0 0.008 0.6)
    //static
    ( 6 0 0)
    ( 6 0.008 0)
    ( 6 0.008 0.6)
    ( 6 0 0.6)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (250 1 38) simpleGrading (1 1 1)
    hex (1 8 9 2 5 11 10 6) (125 1 38) simpleGrading (1 1 1)
);
edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (8 11 10 9)
        );
    }
    ground1
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }
    ground2
    {
        type wall;
        faces
        (
            (1 8 9 2)
        );
    }
    top1
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    top2
    {
        type patch;
        faces
        (
            (5 11 10 6)
        );
    }
    front1
    {
        type empty;
        faces
        (
            (0 1 5 4)
        );
    }
    back1
    {
        type empty;
        faces
        (
            (3 2 6 7)
        );
    }
    front2
    {
        type empty;
        faces
        (
            (1 8 11 5)
        );
    }
    back2
    {
        type empty;
        faces
        (
            (2 9 10 6)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
